# <span style="color:green">AtliQ Data Analysis project</span>
### Part I: Initialization & Data cleaning
Author: Do Nam Phong (Mason) Phung   
Last update: 2024 Aug 03

### Data overview

In this project, we will work on AtliQ’s sales data from 2017 to 2020.

Data was manually extracted from the company’s Data warehouse, which was orignally stored in the company’s Sales database management system.

### Tools & software used in the project:
- Local database: MySQL 
- Database management: MySQL Benchmark or DBeaver (for its compatibility with MacOS ARM).   
- IDE: Visual Studio Code
- Python libraries: sqlalchemy, pandas, numpy (for data mining, data manipulation)

### Table of contents
<span style="color:green">

- **I. Initialization**: Create mysqlalchemy engine to run MySQL through Python and notebook. Review ERD and data description tables.
- **II. Data cleaning**: Import tables from local MySQL database, clean the data and export them back to MySQL server.

</span>

- III. Data analysis: Do exploratory analysis with SQL to explore the datasets, gather insights for the problems.
- IV. Conclusion: Analyze the problems observed, provide suggestions/make comments.

In [ ]:
# After setting up mySQL server, run this script for a quick data cleaning (skip II. part)
%run src.data_cleaning

## <span style="color:green">**I. Initialization**</span>

### ER diagram of the database

![ER diagram](img/erd_sales.png "ER diagram of the imported data")

*Note that the `transactions` table has no primary key. There are 4 foreign keys in this database: `product_code`, `market_code`, `customer_code`, `date`*

### Data descriptions
For each table

**Transactions**

The table includes the details of the transactions such as product code, customer code, market code, order date, sales amount and profit margin.

| **Variable**             | **Description**                                                                                        |
|--------------------------|--------------------------------------------------------------------------------------------------------|
| product_code             | Identification code of the product                                                                     |
| customer_code            | Identification code of the customer                                                                    |
| market_code              | Identification code of the market                                                                      |
| order_date               | Date of the order                                                                                      |
| sales_qty                | Number of units sold in the order                                                                      |
| sales_amount             | Revenue of the order                                                                                   |
| currency                 | The money currency which was used in the order                                                         |
| profit_margin_percentage | The profit margin as a percentage of sales amount, calculated as (profit_margin / sales_amount) * 100. |
| profit_margin            | The profit from a transaction or group of transactions, calculated as sales amount minus cost price.   |
| cost_price               | The cost of the order                                                                                  |

**Products**

The table contains the type of the products by their product code

| **Variable**             | **Description**                                                                                        |
|--------------------------|--------------------------------------------------------------------------------------------------------|
| product_code             | Identification code of the product                                                                     |
| product_type             | The type of the product (own brand - company's own products, or distribution - third-party products)   |                                                           |

**Markets**

The data of the markets with their names and the zone they belong to based on the market code

| **Variable**             | **Description**                                                                                        |
|--------------------------|--------------------------------------------------------------------------------------------------------|
| market_code              | Identification code of the market                                                                      |
| markets_name             | Geographic name of the market                                                                          |
| zone                     | The geographic zone where the market belongs to (North/Central/South)                                  |

**Customers**

The table contains customers' name and their type by each customer code

| **Variable**             | **Description**                                                                                        |
|--------------------------|--------------------------------------------------------------------------------------------------------|
| customer_code            | Identification code of the customer                                                                    |
| customer_name            | Name of the customer                                                                                   |
| customer_type            | Customer store type (`Brick & Mortar` or `E-commerce`)                                                                                     |

**Date**

The list of date from 2017-1-1 to 2020-06-30 and different time data related to the date

| **Variable**             | **Description**                                                                                        |
|--------------------------|--------------------------------------------------------------------------------------------------------|
| date                     | Date in YYYY-MM-DD format                                                                              |
| cy_date                  | The current year's date in the format YYYY-MM-DD                                                       |
| year                     | The year of the order in YYYY format                                                                   |
| month_name               | Month of the Date in text - MMM format                                                                 |
| date_yy_mmm              | Date in YY-MMM format                                                                                  |

### Load packages and import datasets

Import the required packages for the work

In [ ]:
# SQLhttps://file+.vscode-resource.vscode-cdn.net/Users/masonphung/Desktop/data%20science/data_projects/project-atliq/img/erd_sales.png
from sqlalchemy import create_engine

# Data manipulation
import pandas as pd

Create a local MySQL database with homebrew

In [107]:
## Install MySQL with homebrew
# brew install mysql
# brew services start mysql

## First login to mysql
# mysql -u root -p

## Create a username and password
# CREATE USER ‘root:tttn0711’@localhost;

Import data to the database by reading the SQL dump file using DBeaver. Name the database as `sales` and it after reading the dump file, it should includes 5 tables
- `customers`: Information of customers such as name and business type.
- `date`: All the dates with different formats of them, start from the first transaction date to the last.
- `markets`: Name and zone information of each business market by its code.
- `products`: All product codes and their types (Own brand or distribution).
- `transactions`: Sales data of each transaction in the period.

![Imported DBeaver database](img/dbeaver_imported_db.png "Imported DBeaver database")

**Since we are using jupyter notebook, I will use SQL through python's sqlalchemy.**

In [3]:
# Load SQL extension and create a connection to mysql database
%load_ext sql
%sql mysql+mysqlconnector://root:tttn0711@localhost:3306/sales 
# %sql mysql://username:password@host:port/database_name

# Create an engine as a connector between database and the our editor
engine = create_engine("mysql+mysqlconnector://root:tttn0711@localhost:3306/sales")

In [7]:
%%sql

SHOW VARIABLES WHERE Variable_name = 'hostname'

 * mysql+mysqlconnector://root:***@localhost:3306/sales
1 rows affected.

[('hostname', 'pphungs-mba.local')]

**Take a quick look at the `markets` table**

In [109]:
%%sql
SELECT *
FROM markets
LIMIT 5

 * mysql+mysqlconnector://root:***@localhost:3306/sales
5 rows affected.

[('Mark001', 'Chennai', 'South'),
 ('Mark002', 'Mumbai', 'Central'),
 ('Mark003', 'Ahmedabad', 'North'),
 ('Mark004', 'Delhi NCR', 'North'),
 ('Mark005', 'Kanpur', 'North')]

**Total number of transactions in `transactions` table**

In [110]:
%%sql
SELECT count(*) as total_transaction
FROM transactions

 * mysql+mysqlconnector://root:***@localhost:3306/sales
1 rows affected.

[(148395,)]

**USD transactions in `transactions` table**

In [111]:
%%sql
SELECT *
FROM transactions
WHERE currency = 'USD'

 * mysql+mysqlconnector://root:***@localhost:3306/sales
2 rows affected.

[('Prod003', 'Cus005', 'Mark004', datetime.date(2017, 11, 20), 59, 500.0, 'USD', 0.31, 11625.0, 25875.0),
 ('Prod003', 'Cus005', 'Mark004', datetime.date(2017, 11, 22), 36, 250.0, 'USD', 0.17, 3187.5, 15562.5)]

- *The imported data works fine !*
- *We will need to take a look at the data to make sure it's cleaned*

## <span style="color:green">**II. Data cleaning**</span>

To clean the data, we need to import them from MySQL server. We will use pandas `read_sql_table` with the defined engine.

In [48]:
# Tables to be imported
tables = ['transactions', 'products', 'markets', 'customers', 'date']

# Import the tables using pandas `read_sql_table`
for table in tables:
    try:
        globals()[table] = pd.read_sql_table(table, con=engine)
        print(f'table imported')
    except Exception as e:
        print(f'Failed to import: {e}')

table imported
table imported
table imported
table imported
table imported

### **0. Take a brief look at all of the tables**

Let's take a look at every table and find possible data issues that need cleaning

In [113]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,profit_margin_percentage,profit_margin,cost_price
0,Prod279,Cus020,Mark011,2017-10-11,1,102.0,INR,0.39,39.78,62.22
1,Prod279,Cus020,Mark011,2017-10-18,1,102.0,INR,-0.12,-12.24,114.24
2,Prod279,Cus020,Mark011,2017-10-19,1,102.0,INR,0.29,29.58,72.42
3,Prod279,Cus020,Mark011,2017-11-08,1,102.0,INR,0.36,36.72,65.28
4,Prod279,Cus020,Mark011,2018-03-09,1,102.0,INR,-0.35,-35.70,137.70

Possible cleaning checks:
- As we are dealing currency, it is better if we have all of the currency and its related variables synced as a whole.
- `sales_qty`, `sales_amount` and `cost_price` values should be larger than 0 (or at least with `sales_qty` larger than 1)

In [114]:
transactions.describe()

,order_date,sales_qty,sales_amount,profit_margin_percentage,profit_margin,cost_price
count,148395,148395.000000,1.483950e+05,148395.000000,148395.000000,1.483950e+05
mean,2019-01-09 14:59:53.086020864,16.370376,6.636433e+03,0.024448,166.158350,6.470649e+03
min,2017-10-04 00:00:00,1.000000,5.000000e+00,-0.350000,-369348.500000,3.050000e+00
25%,2018-05-15 00:00:00,1.000000,1.760000e+02,-0.160000,-67.320000,1.665000e+02
50%,2018-12-20 00:00:00,1.000000,5.190000e+02,0.020000,5.550000,5.082600e+02
75%,2019-08-29 00:00:00,7.000000,3.065000e+03,0.210000,105.600000,2.907130e+03
max,2020-06-26 00:00:00,14049.000000,1.510944e+06,0.400000,481775.040000,1.846742e+06
std,NaN,115.394269,3.008649e+04,0.218956,6850.373158,2.977992e+04

Looks like the dataset matches one of our requirements (`sales_qty` min value > 1, `sales_amount` and `cost_price` min values > 0)

In [115]:
products.head()

  product_code product_type
0      Prod001  Own Brand\r
1      Prod002  Own Brand\r
2      Prod003  Own Brand\r
3      Prod004  Own Brand\r
4      Prod005  Own Brand\r

- Carriage return `\r` can be found in each observation of `product_type`, this can be due to an issue when we use `pd.read_sql_table` to import the dataset. We will need to remove them.

In [116]:
markets

   markets_code  markets_name     zone
0       Mark001       Chennai    South
1       Mark002        Mumbai  Central
2       Mark003     Ahmedabad    North
3       Mark004     Delhi NCR    North
4       Mark005        Kanpur    North
5       Mark006     Bengaluru    South
6       Mark007        Bhopal  Central
7       Mark008       Lucknow    North
8       Mark009         Patna    North
9       Mark010         Kochi    South
10      Mark011        Nagpur  Central
11      Mark012         Surat    North
12      Mark013        Bhopal  Central
13      Mark014     Hyderabad    South
14      Mark015  Bhubaneshwar    South
15      Mark097      New York
16      Mark999         Paris

New York and Paris markets are not needed as we are focusing on the domestic. We will need to remove any observation from all tables that is related to these two markets.

In [117]:
customers.head()

  customer_code    custmer_name   customer_type
0        Cus001    Surge Stores  Brick & Mortar
1        Cus002    Nomad Stores  Brick & Mortar
2        Cus003    Excel Stores  Brick & Mortar
3        Cus004  Surface Stores  Brick & Mortar
4        Cus005  Premium Stores  Brick & Mortar

In [50]:
date.head()

        date    cy_date  year month_name date_yy_mmm
0 2017-06-01 2017-06-01  2017       June     17-Jun
1 2017-06-02 2017-06-01  2017       June     17-Jun
2 2017-06-03 2017-06-01  2017       June     17-Jun
3 2017-06-04 2017-06-01  2017       June     17-Jun
4 2017-06-05 2017-06-01  2017       June     17-Jun

- Remove found `\r`.
- Check if the time span is correct.

### **1. Check for missing data**

In [119]:
# Define a function to report missing data
def report_missing(df):
    """
    Create a dataframe, then calculate the number of null and blank value.
    
    Parameter:
    df (DataFrame)
        The dataframe used to check for missing values
    
    Return:
    completed_report (DataFrame)
        The report table including the number of null, blank values and their percentage in total
    """
    # Total observation count
    total_obs = df.shape[0]
    # Create a dataframe
    missing = pd.DataFrame()
    # Total nulls
    missing['null_count'] = df.isnull().sum()
    # Total blank value
    missing['blank_count'] = [df[df[c].astype(str) == ""][c].count() for c in df.columns]
    # Total missing value
    missing['total_missing'] = missing.sum(axis = 1)
    # Report missing percentage
    missing['null_percent'] = round(100* (missing['null_count']/ total_obs), 2)
    missing['blank_percent'] = round(100* (missing['blank_count']/ total_obs), 2)
    missing['total_missing_percent'] = round(100* (missing['total_missing']/ total_obs), 2)
    
    completed_report = missing.sort_values(
        by = 'total_missing_percent',
        ascending = False
    )
    return completed_report

report_missing(transactions)

,null_count,blank_count,total_missing,null_percent,blank_percent,total_missing_percent
product_code,0,0,0,0.0,0.0,0.0
customer_code,0,0,0,0.0,0.0,0.0
market_code,0,0,0,0.0,0.0,0.0
order_date,0,0,0,0.0,0.0,0.0
sales_qty,0,0,0,0.0,0.0,0.0
sales_amount,0,0,0,0.0,0.0,0.0
currency,0,0,0,0.0,0.0,0.0
profit_margin_percentage,0,0,0,0.0,0.0,0.0
profit_margin,0,0,0,0.0,0.0,0.0
cost_price,0,0,0,0.0,0.0,0.0

The table does not seem to have any missing data

### **2. Remove carriage returns '\r' found in output datasets**

In `products` and `date` datasets, '\r' are found in the the observations of their last columns. We need to remove these excessive tags.

In [120]:
# Replace '\r' characters with a space
products['product_type'] = products['product_type'].str.replace('\r', ' ')
date['date_yy_mmm'] = date['date_yy_mmm'].str.replace('\r', ' ')

products.head()

  product_code product_type
0      Prod001   Own Brand
1      Prod002   Own Brand
2      Prod003   Own Brand
3      Prod004   Own Brand
4      Prod005   Own Brand

In [121]:
date.head()

        date    cy_date  year month_name date_yy_mmm
0 2017-06-01 2017-06-01  2017       June     17-Jun
1 2017-06-02 2017-06-01  2017       June     17-Jun
2 2017-06-03 2017-06-01  2017       June     17-Jun
3 2017-06-04 2017-06-01  2017       June     17-Jun
4 2017-06-05 2017-06-01  2017       June     17-Jun

Completed !

### **3. Multiple currencies**

In the dataset, there are two currencies observed: Indian Rupee (INR) and United States Dollar (USD). We'll convert all of the USD sales into INR (As the INR dominates the dataset).

In [122]:
# Check for the currencies in the dataset
transactions['currency'].unique()

array(['INR', 'USD'], dtype=object)

In [123]:
# Print the rows with `currency = USD`
transactions[transactions['currency'] == 'USD']

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,profit_margin_percentage,profit_margin,cost_price
135937,Prod003,Cus005,Mark004,2017-11-20,59,500.0,USD,0.31,11625.0,25875.0
135938,Prod003,Cus005,Mark004,2017-11-22,36,250.0,USD,0.17,3187.5,15562.5

- There are 02 observations that have 'USD' as the currency. Note that `profit_margin` and `cost_price` are still in INR, only the `sales_amount` is in USD.
- If we take `cost_price` + `profit_margin`, we will get the `sales_amount` in INR for these two observation. Let's replace the `sales_amount` of them with the newly calculated in INR.

In [124]:
# Replace any `sales_amount` value with `currency = USD` with the sum of `profit_margin` and `cost_price`
transactions.loc[transactions['currency'] == 'USD', 'sales_amount'] = transactions['profit_margin'] + transactions['cost_price']
# Take a look at the result
transactions[transactions['currency'] == 'USD']

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,profit_margin_percentage,profit_margin,cost_price
135937,Prod003,Cus005,Mark004,2017-11-20,59,37500.0,USD,0.31,11625.0,25875.0
135938,Prod003,Cus005,Mark004,2017-11-22,36,18750.0,USD,0.17,3187.5,15562.5

**Change the 'USD' currency to 'INR'**

In [125]:
# Replace any currency = `USD` with `INR`
transactions['currency'] = transactions['currency'].replace(['USD'], 'INR')
# Check if there is any `currency = USD` left
transactions[transactions['currency'] == 'USD']

Empty DataFrame
Columns: [product_code, customer_code, market_code, order_date, sales_qty, sales_amount, currency, profit_margin_percentage, profit_margin, cost_price]
Index: []

### **4. Only focus on the domestic markets**

By observing the dataset `markets`, we see that aside from local Indian markets, there are also details about two overseas markets Paris and New York. As we are focusing on the domestic, there is no need to care about these two markets. Therefore, we'll remove the observations related to these two markets in the `markets` and the `transactions` table (if there is any).

In [126]:
# Apply ~ as the logical negation, to keep the rows that does not match the criteria
markets = markets[~markets['markets_code'].isin(['Mark097', 'Mark999'])]
markets

   markets_code  markets_name     zone
0       Mark001       Chennai    South
1       Mark002        Mumbai  Central
2       Mark003     Ahmedabad    North
3       Mark004     Delhi NCR    North
4       Mark005        Kanpur    North
5       Mark006     Bengaluru    South
6       Mark007        Bhopal  Central
7       Mark008       Lucknow    North
8       Mark009         Patna    North
9       Mark010         Kochi    South
10      Mark011        Nagpur  Central
11      Mark012         Surat    North
12      Mark013        Bhopal  Central
13      Mark014     Hyderabad    South
14      Mark015  Bhubaneshwar    South

In [127]:
transactions[transactions['market_code'].isin(['Mark097', 'Mark999'])]

Empty DataFrame
Columns: [product_code, customer_code, market_code, order_date, sales_qty, sales_amount, currency, profit_margin_percentage, profit_margin, cost_price]
Index: []

There is no transaction data related to the two markets so we can skip here.

### **5. Export the dataset back to SQL server as a table**

We have finished cleaning the data, let's export them back to MySQL database

In [131]:
# Write the records in each data frame to the SQL server, replace if exist]
dfs = {
    'transactions': transactions,
    'markets': markets,
    'products': products,
    'customers': customers,
    'date': date 
}


for name, df in dfs.items():
    try:
        df.to_sql(name = name, con = engine, if_exists = 'replace', index = False)
        print(f'{name} table exported')
    except Exception as e:
        print(f'{name}Failed to export: {e}')

transactions table exported
markets table exported
products table exported
customers table exported
date table exported

**Recheck the new tables in MySQL database**

Let's find if there is any transaction in USD currency

In [132]:
%%sql
SELECT *
FROM transactions
WHERE currency = 'USD'

 * mysql+mysqlconnector://root:***@localhost:3306/sales
0 rows affected.

[]

There is no transactions with `USD` currency. Looks like we have successfully replaced the original data with the cleaned ones.